![png](DATA/movies-ERD.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

**Import Data**

In [2]:
titles = pd.read_csv("DATA/titles.csv")
titles.info()
titles.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1452564 entries, 0 to 1452563
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1452564 non-null  object
 1   ordering         1452564 non-null  int64
 2   title            1452564 non-null  object
 3   region           1452564 non-null  object
 4   language         4018 non-null     object
 5   types            981678 non-null   object
 6   attributes       47016 non-null    object
 7   isOriginalTitle  1451222 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 88.7+ MB

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [3]:
basics = pd.read_csv("DATA/basics.csv")
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [4]:
ratings = pd.read_csv("DATA/ratings.csv")
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

**Connection**

In [5]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
db_name = "movies_db"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [6]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [7]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies_db
0              genres
1             ratings
2        title_basics
3        title_genres

In [8]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default           Extra
0    genre_id          int   NO  PRI    None  auto_increment
1  genre_name  varchar(45)  YES         None

In [9]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, engine)
describe

             Field Type Null  Key Default           Extra
0           tconst  int   NO  PRI    None  auto_increment
1   average_rating  int  YES         None
2  number_of_votes  int  YES         None

In [10]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,int,NO,PRI,None,
1,primary_title,longtext,YES,,None,
2,start_year,float,YES,,None,
3,runtime,int,YES,,None,
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [11]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, engine)
describe

      Field Type Null  Key Default           Extra
0    tconst  int   NO  PRI    None  auto_increment
1  genre_id  int  YES         None

In [12]:
basics['tconst'] = basics['tconst'].str.replace('tt', '')

In [13]:
basics['tconst'] = basics['tconst'].astype(int)

In [14]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  int32
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int32(1), int64(2), object(4)
memory usage: 5.6+ MB

In [15]:
ratings['tconst'] = ratings['tconst'].str.replace('tt', '')

In [16]:
ratings['tconst'] = ratings['tconst'].astype(int)

In [17]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  int32
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int32(1), int64(1)
memory usage: 1.4 MB

**Add Data**

In [18]:
#ratings
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, engine)
describe

             Field Type Null  Key Default           Extra
0           tconst  int   NO  PRI    None  auto_increment
1   average_rating  int  YES         None
2  number_of_votes  int  YES         None

In [19]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'average_rating', 'number_of_votes'], dtype=object)

In [20]:
# Checking dataframe's columns
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [21]:
# Rename columns to match SQL table
rename_map = {"averageRating":"average_rating",
             "numVotes":"number_of_votes"}
ratings = ratings.rename(rename_map,axis=1)
ratings.head(2)

   tconst  average_rating  number_of_votes
0   35423             6.4            87153
1   62336             6.4              175

In [22]:
ratings.to_sql("ratings",engine,index=False, if_exists='append')

71900

In [23]:
# confirm the data has been added
q = """SELECT * FROM ratings;"""
pd.read_sql(q,engine)

         tconst  average_rating  number_of_votes
0         35423               6            87153
1         62336               6              175
2         69049               7             7754
3         88751               5              336
4         96056               6              846
...         ...             ...              ...
71895  27250496               7               24
71896  27547850               5               23
71897  27554856               6               13
71898  27579598               7                6
71899  28117438               3               19

[71900 rows x 3 columns]

In [24]:
#basics
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,int,NO,PRI,None,
1,primary_title,longtext,YES,,None,
2,start_year,float,YES,,None,
3,runtime,int,YES,,None,
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [25]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime', 'created_at',
       'updated_at'], dtype=object)

In [26]:
# Checking dataframe's columns
basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [27]:
# Rename columns to match SQL table
rename_map = {"primaryTitle":"primary_title",
             "runtimeMinutes":"runtime",
             "startYear":"start_year"}
basics = basics.rename(rename_map,axis=1)
basics.head(2)

,tconst,titleType,primary_title,originalTitle,isAdult,start_year,endYear,runtime,genres
0,35423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,62336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama

In [28]:
basics = basics.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'endYear', 'genres'], axis=1)

In [29]:
basics.head(2)

,tconst,primary_title,start_year,runtime
0,35423,Kate & Leopold,2001.0,118
1,62336,The Tango of the Widower and Its Distorting Mi...,2020.0,70

In [30]:
basics.dtypes

tconst             int32
primary_title     object
start_year       float64
runtime            int64
dtype: object

In [31]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,int,NO,PRI,None,
1,primary_title,longtext,YES,,None,
2,start_year,float,YES,,None,
3,runtime,int,YES,,None,
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [32]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
engine.execute(q)

In [33]:
basics.to_sql("title_basics",engine,index=False, if_exists='append')

86979

In [34]:
# confirm the data has been added
q = """SELECT * FROM title_basics;"""
pd.read_sql(q,engine)

,tconst,primary_title,start_year,runtime,created_at,updated_at
0,35423,Kate & Leopold,2001.0,118,2023-12-01 10:35:28,2023-12-01 10:35:28
1,62336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,2023-12-01 10:35:28,2023-12-01 10:35:28
2,69049,The Other Side of the Wind,2018.0,122,2023-12-01 10:35:28,2023-12-01 10:35:28
3,88751,The Naked Monster,2005.0,100,2023-12-01 10:35:28,2023-12-01 10:35:28
4,96056,Crime and Punishment,2002.0,126,2023-12-01 10:35:28,2023-12-01 10:35:28
...,...,...,...,...,...,...
86974,28378171,Yami Douga 23,2019.0,56,2023-12-01 10:35:31,2023-12-01 10:35:31
86975,28378172,Yami Douga 25,2020.0,54,2023-12-01 10:35:31,2023-12-01 10:35:31
86976,28378173,Yami Douga 24,2020.0,51,2023-12-01 10:35:31,2023-12-01 10:35:31
86977,28394080,The Apology,2000.0,89,2023-12-01 10:35:31,2023-12-01 10:35:31
86978,28429983,Another State of Mind,2007.0,32,2023-12-01 10:35:31,2023-12-01 10:35:31